==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
PyramidVisionTransformer                 [1, 64, 56, 56]           389,376
├─PatchEmbed: 1-1                        [1, 3136, 64]             --
│    └─Conv2d: 2-1                       [1, 64, 56, 56]           3,136
│    └─LayerNorm: 2-2                    [1, 3136, 64]             128
├─Dropout: 1-2                           [1, 3136, 64]             --
├─ModuleList: 1-3                        --                        --
│    └─Block: 2-3                        [1, 3136, 64]             --
│    │    └─LayerNorm: 3-1               [1, 3136, 64]             128
│    │    └─Attention: 3-2               [1, 3136, 64]             278,976
│    │    └─Identity: 3-3                [1, 3136, 64]             --
│    │    └─LayerNorm: 3-4               [1, 3136, 64]             128
│    │    └─Mlp: 3-5                     [1, 3136, 64]             66,112
│    │    └─Identity: 3-6                [1, 3136, 64]             --
│    └─Block: 2-4                        [1, 3136, 64]             --
│    │    └─LayerNorm: 3-7               [1, 3136, 64]             128
│    │    └─Attention: 3-8               [1, 3136, 64]             278,976
│    │    └─DropPath: 3-9                [1, 3136, 64]             --
│    │    └─LayerNorm: 3-10              [1, 3136, 64]             128
│    │    └─Mlp: 3-11                    [1, 3136, 64]             66,112
│    │    └─DropPath: 3-12               [1, 3136, 64]             --
│    └─Block: 2-5                        [1, 3136, 64]             --
│    │    └─LayerNorm: 3-13              [1, 3136, 64]             128
│    │    └─Attention: 3-14              [1, 3136, 64]             278,976
│    │    └─DropPath: 3-15               [1, 3136, 64]             --
│    │    └─LayerNorm: 3-16              [1, 3136, 64]             128
│    │    └─Mlp: 3-17                    [1, 3136, 64]             66,112
│    │    └─DropPath: 3-18               [1, 3136, 64]             --
├─PatchEmbed: 1-4                        [1, 784, 128]             --
│    └─Conv2d: 2-6                       [1, 128, 28, 28]          32,896
│    └─LayerNorm: 2-7                    [1, 784, 128]             256
├─Dropout: 1-5                           [1, 784, 128]             --
├─ModuleList: 1-6                        --                        --
│    └─Block: 2-8                        [1, 784, 128]             --
│    │    └─LayerNorm: 3-19              [1, 784, 128]             256
│    │    └─Attention: 3-20              [1, 784, 128]             328,576
│    │    └─DropPath: 3-21               [1, 784, 128]             --
│    │    └─LayerNorm: 3-22              [1, 784, 128]             256
│    │    └─Mlp: 3-23                    [1, 784, 128]             263,296
│    │    └─DropPath: 3-24               [1, 784, 128]             --
│    └─Block: 2-9                        [1, 784, 128]             --
│    │    └─LayerNorm: 3-25              [1, 784, 128]             256
│    │    └─Attention: 3-26              [1, 784, 128]             328,576
│    │    └─DropPath: 3-27               [1, 784, 128]             --
│    │    └─LayerNorm: 3-28              [1, 784, 128]             256
│    │    └─Mlp: 3-29                    [1, 784, 128]             263,296
│    │    └─DropPath: 3-30               [1, 784, 128]             --
│    └─Block: 2-10                       [1, 784, 128]             --
│    │    └─LayerNorm: 3-31              [1, 784, 128]             256
│    │    └─Attention: 3-32              [1, 784, 128]             328,576
│    │    └─DropPath: 3-33               [1, 784, 128]             --
│    │    └─LayerNorm: 3-34              [1, 784, 128]             256
│    │    └─Mlp: 3-35                    [1, 784, 128]             263,296
│    │    └─DropPath: 3-36               [1, 784, 128]             --
│    └─Block: 2-11                       [1, 784, 128]             --
│    │    └─LayerNorm: 3-37              [1, 784, 128]             256
│    │    └─Attention: 3-38              [1, 784, 128]             328,576
│    │    └─DropPath: 3-39               [1, 784, 128]             --
│    │    └─LayerNorm: 3-40              [1, 784, 128]             256
│    │    └─Mlp: 3-41                    [1, 784, 128]             263,296
│    │    └─DropPath: 3-42               [1, 784, 128]             --
├─PatchEmbed: 1-7                        [1, 196, 320]             --
│    └─Conv2d: 2-12                      [1, 320, 14, 14]          164,160
│    └─LayerNorm: 2-13                   [1, 196, 320]             640
├─Dropout: 1-8                           [1, 196, 320]             --
├─ModuleList: 1-9                        --                        --
│    └─Block: 2-14                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-43              [1, 196, 320]             640
│    │    └─Attention: 3-44              [1, 196, 320]             821,440
│    │    └─DropPath: 3-45               [1, 196, 320]             --
│    │    └─LayerNorm: 3-46              [1, 196, 320]             640
│    │    └─Mlp: 3-47                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-48               [1, 196, 320]             --
│    └─Block: 2-15                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-49              [1, 196, 320]             640
│    │    └─Attention: 3-50              [1, 196, 320]             821,440
│    │    └─DropPath: 3-51               [1, 196, 320]             --
│    │    └─LayerNorm: 3-52              [1, 196, 320]             640
│    │    └─Mlp: 3-53                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-54               [1, 196, 320]             --
│    └─Block: 2-16                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-55              [1, 196, 320]             640
│    │    └─Attention: 3-56              [1, 196, 320]             821,440
│    │    └─DropPath: 3-57               [1, 196, 320]             --
│    │    └─LayerNorm: 3-58              [1, 196, 320]             640
│    │    └─Mlp: 3-59                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-60               [1, 196, 320]             --
│    └─Block: 2-17                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-61              [1, 196, 320]             640
│    │    └─Attention: 3-62              [1, 196, 320]             821,440
│    │    └─DropPath: 3-63               [1, 196, 320]             --
│    │    └─LayerNorm: 3-64              [1, 196, 320]             640
│    │    └─Mlp: 3-65                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-66               [1, 196, 320]             --
│    └─Block: 2-18                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-67              [1, 196, 320]             640
│    │    └─Attention: 3-68              [1, 196, 320]             821,440
│    │    └─DropPath: 3-69               [1, 196, 320]             --
│    │    └─LayerNorm: 3-70              [1, 196, 320]             640
│    │    └─Mlp: 3-71                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-72               [1, 196, 320]             --
│    └─Block: 2-19                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-73              [1, 196, 320]             640
│    │    └─Attention: 3-74              [1, 196, 320]             821,440
│    │    └─DropPath: 3-75               [1, 196, 320]             --
│    │    └─LayerNorm: 3-76              [1, 196, 320]             640
│    │    └─Mlp: 3-77                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-78               [1, 196, 320]             --
│    └─Block: 2-20                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-79              [1, 196, 320]             640
│    │    └─Attention: 3-80              [1, 196, 320]             821,440
│    │    └─DropPath: 3-81               [1, 196, 320]             --
│    │    └─LayerNorm: 3-82              [1, 196, 320]             640
│    │    └─Mlp: 3-83                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-84               [1, 196, 320]             --
│    └─Block: 2-21                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-85              [1, 196, 320]             640
│    │    └─Attention: 3-86              [1, 196, 320]             821,440
│    │    └─DropPath: 3-87               [1, 196, 320]             --
│    │    └─LayerNorm: 3-88              [1, 196, 320]             640
│    │    └─Mlp: 3-89                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-90               [1, 196, 320]             --
│    └─Block: 2-22                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-91              [1, 196, 320]             640
│    │    └─Attention: 3-92              [1, 196, 320]             821,440
│    │    └─DropPath: 3-93               [1, 196, 320]             --
│    │    └─LayerNorm: 3-94              [1, 196, 320]             640
│    │    └─Mlp: 3-95                    [1, 196, 320]             820,800
│    │    └─DropPath: 3-96               [1, 196, 320]             --
│    └─Block: 2-23                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-97              [1, 196, 320]             640
│    │    └─Attention: 3-98              [1, 196, 320]             821,440
│    │    └─DropPath: 3-99               [1, 196, 320]             --
│    │    └─LayerNorm: 3-100             [1, 196, 320]             640
│    │    └─Mlp: 3-101                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-102              [1, 196, 320]             --
│    └─Block: 2-24                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-103             [1, 196, 320]             640
│    │    └─Attention: 3-104             [1, 196, 320]             821,440
│    │    └─DropPath: 3-105              [1, 196, 320]             --
│    │    └─LayerNorm: 3-106             [1, 196, 320]             640
│    │    └─Mlp: 3-107                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-108              [1, 196, 320]             --
│    └─Block: 2-25                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-109             [1, 196, 320]             640
│    │    └─Attention: 3-110             [1, 196, 320]             821,440
│    │    └─DropPath: 3-111              [1, 196, 320]             --
│    │    └─LayerNorm: 3-112             [1, 196, 320]             640
│    │    └─Mlp: 3-113                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-114              [1, 196, 320]             --
│    └─Block: 2-26                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-115             [1, 196, 320]             640
│    │    └─Attention: 3-116             [1, 196, 320]             821,440
│    │    └─DropPath: 3-117              [1, 196, 320]             --
│    │    └─LayerNorm: 3-118             [1, 196, 320]             640
│    │    └─Mlp: 3-119                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-120              [1, 196, 320]             --
│    └─Block: 2-27                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-121             [1, 196, 320]             640
│    │    └─Attention: 3-122             [1, 196, 320]             821,440
│    │    └─DropPath: 3-123              [1, 196, 320]             --
│    │    └─LayerNorm: 3-124             [1, 196, 320]             640
│    │    └─Mlp: 3-125                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-126              [1, 196, 320]             --
│    └─Block: 2-28                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-127             [1, 196, 320]             640
│    │    └─Attention: 3-128             [1, 196, 320]             821,440
│    │    └─DropPath: 3-129              [1, 196, 320]             --
│    │    └─LayerNorm: 3-130             [1, 196, 320]             640
│    │    └─Mlp: 3-131                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-132              [1, 196, 320]             --
│    └─Block: 2-29                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-133             [1, 196, 320]             640
│    │    └─Attention: 3-134             [1, 196, 320]             821,440
│    │    └─DropPath: 3-135              [1, 196, 320]             --
│    │    └─LayerNorm: 3-136             [1, 196, 320]             640
│    │    └─Mlp: 3-137                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-138              [1, 196, 320]             --
│    └─Block: 2-30                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-139             [1, 196, 320]             640
│    │    └─Attention: 3-140             [1, 196, 320]             821,440
│    │    └─DropPath: 3-141              [1, 196, 320]             --
│    │    └─LayerNorm: 3-142             [1, 196, 320]             640
│    │    └─Mlp: 3-143                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-144              [1, 196, 320]             --
│    └─Block: 2-31                       [1, 196, 320]             --
│    │    └─LayerNorm: 3-145             [1, 196, 320]             640
│    │    └─Attention: 3-146             [1, 196, 320]             821,440
│    │    └─DropPath: 3-147              [1, 196, 320]             --
│    │    └─LayerNorm: 3-148             [1, 196, 320]             640
│    │    └─Mlp: 3-149                   [1, 196, 320]             820,800
│    │    └─DropPath: 3-150              [1, 196, 320]             --
├─PatchEmbed: 1-10                       [1, 49, 512]              --
│    └─Conv2d: 2-32                      [1, 512, 7, 7]            655,872
│    └─LayerNorm: 2-33                   [1, 49, 512]              1,024
├─Dropout: 1-11                          [1, 49, 512]              --
├─ModuleList: 1-12                       --                        --
│    └─Block: 2-34                       [1, 49, 512]              --
│    │    └─LayerNorm: 3-151             [1, 49, 512]              1,024
│    │    └─Attention: 3-152             [1, 49, 512]              1,050,624
│    │    └─DropPath: 3-153              [1, 49, 512]              --
│    │    └─LayerNorm: 3-154             [1, 49, 512]              1,024
│    │    └─Mlp: 3-155                   [1, 49, 512]              2,099,712
│    │    └─DropPath: 3-156              [1, 49, 512]              --
│    └─Block: 2-35                       [1, 49, 512]              --
│    │    └─LayerNorm: 3-157             [1, 49, 512]              1,024
│    │    └─Attention: 3-158             [1, 49, 512]              1,050,624
│    │    └─DropPath: 3-159              [1, 49, 512]              --
│    │    └─LayerNorm: 3-160             [1, 49, 512]              1,024
│    │    └─Mlp: 3-161                   [1, 49, 512]              2,099,712
│    │    └─DropPath: 3-162              [1, 49, 512]              --
│    └─Block: 2-36                       [1, 49, 512]              --
│    │    └─LayerNorm: 3-163             [1, 49, 512]              1,024
│    │    └─Attention: 3-164             [1, 49, 512]              1,050,624
│    │    └─DropPath: 3-165              [1, 49, 512]              --
│    │    └─LayerNorm: 3-166             [1, 49, 512]              1,024
│    │    └─Mlp: 3-167                   [1, 49, 512]              2,099,712
│    │    └─DropPath: 3-168              [1, 49, 512]              --
==========================================================================================
Total params: 43,693,568
Trainable params: 43,693,568
Non-trainable params: 0
Total mult-adds (M): 584.67
==========================================================================================
Input size (MB): 0.60
Forward/backward pass size (MB): 208.63
Params size (MB): 173.22
Estimated Total Size (MB): 382.45
==========================================================================================